{
    "filter": "منقي",
    "user_name": "اسم المستخدم",
    "password": "كلمه السر",
    "login": "تسجيل الدخول",
    "overview_1": "الحد الأدنى من جافا سكريبت إطار ومكونات قائمة بذاتها لتطوير مواقع عالية الجودة وتطبيقات صفحة واحدة.",
    "overview_2": "يعمل DataFormsJS مع محركات القوالب والعرض الشائعة ويتعامل مع منطق وحدة التحكم وحالة الطراز.",
    "works_with": "يعمل مع",
    "and_more": "و اكثر!",
    "faster_dev_title": "أسرع التنمية",
    "faster_dev_desc": "عرض البيانات من خدمات الويب و GraphQL باستخدام علامات HTML فقط وتحديد ميزات التطبيق والموقع باستخدام سمات HTML.",
    "small_size_title": "حجم صغير",
    "small_size_desc": "جميع الملفات صغيرة الحجم ويتم تنزيلها فقط عند استخدامها مما يسمح بأداء أفضل وموقع أصغر.",
    "easy_learn_title": "سهل التعلم",
    "easy_learn_desc": "تم تصميم DataFormsJS حول HTML و CSS و JavaScript و Templating ولديه الحد الأدنى من JavaScript و HTML API حتى يمكنك البدء على الفور.",
    "stability_title": "المزيد",
    "stability_desc": "مصممة للاستخدام على المدى الطويل.الموقع الذي تم تطويره مع DataFormsJS اليوم سيعمل بشكل رائع ويسهل الحفاظ عليه بعد عقود من الآن.",
    "flexibility_title": "المرونة",
    "flexibility_desc": "يعمل بشكل جيد مع التعليمات البرمجية الأخرى وتم تصميم واجهة برمجة التطبيقات من أجل المرونة والميزات المخصصة.إذا كنت تعتقد ذلك ، يمكنك بنائه باستخدام DataFormsJS.",
    "better_title": "مواقع أفضل",
    "better_desc": "تم تصميم DataFormsJS ليكون تجربة رائعة لكل من المطورين والمستخدمين النهائيين مما يتيح لك إنشاء مواقع أفضل.",
    "view_sample": "عرض عينة كاملة",
    "hello_world_example": "مرحبا العالم مثال",
    "hello_world_hbs_desc": "يعد DataFormsJS Framework مناسبًا تمامًا للتطبيقات ذات الصفحة الواحدة (SPA).تُستخدم عناصر <template> و <script> مع [مسار البيانات] لتحديد مسارات مختلفة (صفحات الويب) ويمكن تمرير المتغيرات من عنوان URL إلى نموذج الصفحة.يستخدم هذا المثال HandlebarsJS لتقديم القالب.",
    "hello_world_js_desc": "استخدام قالب أو محرك عرض مثل HandlebarsJS أو Vue غير مطلوب.في هذا المثال ، يتم استخدام مكون إضافي [dataBind.js] مع السمة [ربط البيانات] لعرض المتغير من عنوان URL.",
    "hello_world_web_desc": "يتضمن DataFormsJS Web Components التي يمكن استخدامها على المتصفحات الحديثة وتوفر تحذيرًا سهلًا للمستخدمين الذين لديهم متصفحات أقدم.غالبًا ما يتم وصف مكونات الويب على أنها مستقبل تطوير الويب نظرًا لمعاييرها المحددة جيدًا والتي توفر تشابهًا وظيفيًا لـ JavaScript Frameworks أثناء استخدام كود أقل.",
    "hello_world_react_desc": "يوفر DataFormsJS مترجمًا يستند إلى الويب [jsxLoader.js] يمكن استخدامه كبديل عن Babel. يسمح باستخدام JSX داخل صفحات الويب دون الحاجة إلى عملية بناء. المترجم صغير لتحميل وسريع للغاية للتشغيل.",
    "json_data_example": "عرض بيانات JSON من خدمة ويب",
    "json_data_hbs_desc": "باستخدام DataFormsJS ، يمكنك عرض البيانات من خدمات الويب باستخدام العلامات فقط (HTML و Templating).يمكن تطوير كائنات صفحة مختلفة محددة في [صفحة البيانات] للتعامل مع منطق وحدة التحكم وحالة الطراز.يسمح كائن الصفحة المدمج [jsonData] بالتحكم في عرض HTML الذي سيتم تقديمه بناءً على حالة الطلب [isLownload، isLoaded، hasError].في هذا المثال ، يتم استخدام السمات [مرشح بيانات محدد] و [فرز البيانات] بواسطة المكونات الإضافية للسماح بتفاعل المستخدم مع جدول البيانات.يتم تنزيل قوالب الصفحة وتخزينها مؤقتًا استنادًا إلى السمة [src] الخاصة بطرق المطابقة.",
    "json_data_vue_desc": "يدعم DataFormsJS Vue كمحرك عرض يسمح للتطبيقات بعرض البيانات باستخدام Vue دون الحاجة إلى كتابة JavaScript. يتم تعيين نموذج Vue Instance الخاص بها لكل مسار وعند استخدام كائن الصفحة المضمن [jsonData] يمكن استخدام [isLoading، isLoaded، hasError] للتحكم في ما يتم عرضه. في هذا المثال ، تم تعريف [بلدان البيانات] و [مناطق البيانات] على المسارات التي تعدها أيضًا كمثيلات [بلدان] و [مناطق] مع مراقبي Vue ؛ يمثل كلا الموقعين بيانات من خدمة الويب التي تم تنزيلها. يعمل DataFormsJS مع كل من Vue 2 و Vue 3.",
    "json_data_react_desc": "توفر DataFormsJS أيضًا مجموعة من مكونات التفاعل (JSX و JS) التي يمكن استخدامها لتوفير وظائف مماثلة للإطار القياسي.تكون React Components صغيرة الحجم وتتضمن ميزات مثل عرض بيانات خدمة الويب ، ومعالجة الأخطاء ، وفرز الطاولة ، وعناصر التحكم في الفلتر ، والتدويل (i18n) / الترجمات ، وتنسيق البيانات ، وأكثر من ذلك.",
    "json_data_graphql_desc": "يوفر DataFormsJS دعمًا مدمجًا لـ GraphQL.يستخدم هذا المثال HandlebarsJS لعرض البيانات من خدمة GraphQL.يمكن تعيين GraphQL إلى المسارات الكلية والعناصر الفردية على الصفحة ويمكن تضمين الاستعلامات مباشرة في الصفحة أو تنزيلها ديناميكيًا عند استخدامها لأول مرة.",
    "json_data_web_desc": "على غرار React Components ، توفر DataFormsJS أيضًا مجموعة من مكونات الويب التي يمكن استخدامها لتوفير وظائف مماثلة للإطار القياسي.تعد Web Components صغيرة الحجم وتوفر نقطة انطلاق جيدة لتطبيق أو موقع يستخدم Web Components.بالنسبة لـ SPA ، سيقوم المكون <url-hash-route> بتنزيل القوالب وتخزينها مؤقتًا عند استخدامها بناءً على السمة [src].يقوم المكون <json-data> بتمرير البيانات من خدمة الويب إلى العناصر الفرعية باستخدام [ربط البيانات] وخيارات أخرى.",
    "create_site": "إنشاء موقع فوري على الملعب!"
}